CSI API ETABS v1

# cDetailingGetDetailedColumnStacks Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetDetailedColumnStacks(
    	ref int NumberItems,
    	ref string[] ColumnStackIDs
    )

    Function GetDetailedColumnStacks (
    	ByRef NumberItems As Integer,
    	ByRef ColumnStackIDs As String()
    ) As Integer

    Dim instance As cDetailing
    Dim NumberItems As Integer
    Dim ColumnStackIDs As String()
    Dim returnValue As Integer

    returnValue = instance.GetDetailedColumnStacks(NumberItems,
    	ColumnStackIDs)

    int GetDetailedColumnStacks(
    	int% NumberItems,
    	array<String^>^% ColumnStackIDs
    )

    abstract GetDetailedColumnStacks :
            NumberItems : int byref *
            ColumnStackIDs : string[] byref -> int

#### Parameters

NumberItems

    Type: SystemInt32

ColumnStackIDs

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cDetailing Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com